{
	"title":"Apricot Brown Butter Cookies",
	"yield":"Makes 6 dozen cookies",
	"ingredients":[
		{
			"ingredients":["1½ cups (3 sticks) unsalted butter, at room temperature",
			"1/2 cup dark brown sugar",
			"1/2 cup granulated sugar",
			"2 large egg yolks",
			"2 tsp. vanilla extract",
			"3 cups unbleached all-purpose flour",
			"1/2 tsp. salt",
			"1/2 cup to 1 cup apricot preserves"
			]
		}
	],
	"steps":[
		"In a medium skillet or pan, brown 1 cup of the butter. After the butter has browned, allow the butter to cool, stirring every few minutes, until it is the spreadable consistency of softened butter (you basically want it to be the same texture as the remaining stick of butter that has been left to soften at room temperature).",
		"When the browned butter has reached the proper consistency, place it in a large bowl along with the remaining stick of softened butter. Cream the butters together until they are light and fluffy. Slowly add in both the brown sugar and granulated sugar, beating all the while, until everything is blended together.",
		"Beat in the egg yolks and vanilla. With the mixer on medium low speed, slowly add in the flour and salt and mix until everything is well combined and the dough is relatively smooth.",
		"Cover the bowl of dough and refrigerate for at least 1 hour.",
		"When the dough has chilled, preheat oven to 350 degrees. Using about 1 teaspoon of dough at a time (or, for a much larger cookie, a couple of tablespoons of dough), roll dough into a roughly 1-inch ball. Place balls of dough about a inch or so apart on parchment-lined baking sheets. Using the tip of your finger, make a small indentation in the center of each dough ball. Drop a small scoop of apricot preserves into the indentation (a small ball will handle about ¼ of a teaspoon of preserves, but a larger ball can take about three times that much).",
		"Bake the cookies in the center of the oven for 12 to 14 minutes, until the edges are lightly golden. Remove cookies to a wire rack to cool."

	]
}